data_generation/simulation_results/openfoam/case_42/constant/pcb/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/pcb/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    empty
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          1086;
        startFace       898;
    }
    pcb_to_component_4
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          24;
        startFace       1984;
        sampleMode      nearestPatchFace;
        sampleRegion    component_4;
        samplePatch     component_4_to_pcb;
    }
    pcb_to_component_2
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          20;
        startFace       2008;
        sampleMode      nearestPatchFace;
        sampleRegion    component_2;
        samplePatch     component_2_to_pcb;
    }
    pcb_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          222;
        startFace       2028;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_pcb;
    }
    pcb_to_component_0
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          42;
        startFace       2250;
        sampleMode      nearestPatchFace;
        sampleRegion    component_0;
        samplePatch     component_0_to_pcb;
    }
    pcb_to_component_3
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          10;
        startFace       2292;
        sampleMode      nearestPatchFace;
        sampleRegion    component_3;
        samplePatch     component_3_to_pcb;
    }
    pcb_to_component_1
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          48;
        startFace       2302;
        sampleMode      nearestPatchFace;
        sampleRegion    component_1;
        samplePatch     component_1_to_pcb;
    }
)

// ************************************************************************* //
