data_generation/simulation_results/openfoam/case_42/constant/simParams
nIter 2000;
hComponent0 1089.7132447408394;
hComponent1 671.5627544800432;
hComponent2 747.5626887813604;
hComponent3 926.4616536376805;
hComponent4 1450.0835150144048;kComponent0 20.038498511958828;
kComponent1 55.78469181458149;
kComponent2 81.46807227039282;
kComponent3 85.57228907376168;
kComponent4 44.47102742938216;
tAmbient 300;
Ux 2.188768641261029;
kPCB 0.34910266326820527;